Enums/упВариантыОптимизацииМаршрута.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>упВариантыОптимизацииМаршрута</Name>
			<Comment>Используется при решении задачи коммивояжера</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоРасстоянию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоВремени</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/упМетодыРешенияЗК.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>упМетодыРешенияЗК</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЖадныйАлгоритм</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЖадныйАлгоритмСУчетомВременныхОкон</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МетодВетвейИГраниц</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/упМетодыРешенияЗМТ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>упМетодыРешенияЗМТ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>МеханизмСбереженийКларкаРайта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗональноеПланирование</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/упСрокиОтсчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>упСрокиОтсчета</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЗаПоследнююНеделю</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаПоследниеДвеНедели</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаПоследнийМесяц</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаПоследниеТриМесяца</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаПоследниеПолГода</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/упСпособыПланированияРемонтныхРабот.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>упСпособыПланированияРемонтныхРабот</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ДокументомЗаявкаНаРемонт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДокументомРемонт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоВыбору</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/упВариантыНастроек.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>упВариантыНастроек</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючВарианта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТолькоДляАвтора</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Настройки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПеревозки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упВидыПеревозок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/упВариантыНастроек/Ext/Module.bsl
#Область СлужебныеПроцедурыИФункции

// Функция определяет наличие полных прав к данным подсистемы "упВариантыНастроек".
//
Функция ПолныеПраваНаВариантыНастроек() Экспорт
	Возврат Пользователи.РолиДоступны("упДобавлениеИзменениеВариантовНастроек");
КонецФункции

// Проверяет свободно ли наименование варианта настройки.
//
Функция НаименованиеЗанято(Объект, Ссылка, Наименование) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	1 КАК Поле1
	|ИЗ
	|	Справочник.упВариантыНастроек КАК упВариантыНастроек
	|ГДЕ
	|	упВариантыНастроек.Объект = &Объект
	|	И упВариантыНастроек.Ссылка <> &Ссылка
	|	И упВариантыНастроек.Наименование = &Наименование
	|	И упВариантыНастроек.ПометкаУдаления = ЛОЖЬ";
	Запрос.УстановитьПараметр("Объект",       Объект);
	Запрос.УстановитьПараметр("Ссылка",       Ссылка);
	Запрос.УстановитьПараметр("Наименование", Наименование);
	
	УстановитьПривилегированныйРежим(Истина);
	Результат = НЕ Запрос.Выполнить().Пустой();
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Результат;
	
КонецФункции

// Проверяет свободен ли ключ варианта настройки.
//
Функция КлючВариантаЗанят(Объект, Ссылка, КлючВарианта) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	1 КАК Поле1
	|ИЗ
	|	Справочник.упВариантыНастроек КАК упВариантыНастроек
	|ГДЕ
	|	упВариантыНастроек.Объект = &Объект
	|	И упВариантыНастроек.Ссылка <> &Ссылка
	|	И упВариантыНастроек.КлючВарианта = &КлючВарианта
	|	И упВариантыНастроек.ПометкаУдаления = ЛОЖЬ";
	Запрос.УстановитьПараметр("Объект",       Объект);
	Запрос.УстановитьПараметр("Ссылка",       Ссылка);
	Запрос.УстановитьПараметр("КлючВарианта", КлючВарианта);
	
	УстановитьПривилегированныйРежим(Истина);
	Результат = НЕ Запрос.Выполнить().Пустой();
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Результат;
	
КонецФункции

// Запись ошибки в журнале регистрации по варианту настройки.
//
Процедура ОшибкаПоВарианту(Вариант, Сообщение, Реквизит1 = Неопределено, Реквизит2 = Неопределено, Реквизит3 = Неопределено) Экспорт
	
	ЗаписьЖурналаРегистрации(
		"Варианты настроек",
		УровеньЖурналаРегистрации.Ошибка,
		Метаданные.Справочники.упВариантыНастроек,
		Вариант,
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			Сообщение,
			Строка(Реквизит1),
			Строка(Реквизит2),
			Строка(Реквизит3)));
			
КонецПроцедуры

// Возвращает структуру значений параметров планирования рейсов по умолчанию
//
Функция ПараметрыПланированияРейсовПоУмолчанию() Экспорт 
	
	ПараметрыПланирования = Новый Структура;
	ПараметрыПланирования.Вставить("ВариантОптимизацииМаршрута"                              , Перечисления.упВариантыОптимизацииМаршрута.ПоРасстоянию);
	ПараметрыПланирования.Вставить("ВариантОптимизацииЗМТ"                                   , Перечисления.упВариантыОптимизацииМаршрута.ПоРасстоянию); 
	ПараметрыПланирования.Вставить("ГрузоваяЕдиница"                                         , 0); // 0 - масса, 1 - объем, 2 - место, 3 - загрузочный метр
	ПараметрыПланирования.Вставить("ДлинаРейса"                                              , 0);
	ПараметрыПланирования.Вставить("КоличествоРейсов"                                        , 0);
	ПараметрыПланирования.Вставить("КоличествоТочекВРейсе"                                   , 0);
	ПараметрыПланирования.Вставить("КоэффициентСбережения"                                   , 0);
	ПараметрыПланирования.Вставить("МинимальноеСбережение"                                   , 0);
	ПараметрыПланирования.Вставить("ОграничитьДлинуРейса"                                    , Ложь);
	ПараметрыПланирования.Вставить("ОграничитьКоличествоРейсов"                              , Ложь);
	ПараметрыПланирования.Вставить("ОграничитьКоличествоТочекВРейсе"                         , Ложь);
	ПараметрыПланирования.Вставить("ОграничитьРазмерГруза"                                   , Ложь);
	ПараметрыПланирования.Вставить("РазмерГруза"                                             , 0);
	ПараметрыПланирования.Вставить("УчитыватьМинимальноеСбережение"                          , Ложь);
	ПараметрыПланирования.Вставить("МетодРешенияЗК"                                          , Перечисления.упМетодыРешенияЗК.ЖадныйАлгоритм);
	ПараметрыПланирования.Вставить("МетодРешенияЗМТ"                                         , Перечисления.упМетодыРешенияЗМТ.МеханизмСбереженийКларкаРайта);
	ПараметрыПланирования.Вставить("МаксимальныйПроцентЗагрузкиТС"                           , 0);
	ПараметрыПланирования.Вставить("УчитыватьВременныеОкна"                                  , Ложь);
	ПараметрыПланирования.Вставить("МаксимальнаяДлительностьВремениОжиданияВТочке"           , 0); 
	ПараметрыПланирования.Вставить("ПространственныйВес"                                     , 0.4);
	ПараметрыПланирования.Вставить("ВременнойВес"                                            , 0.4);
	ПараметрыПланирования.Вставить("ВесСрочности"                                            , 0.2);
	ПараметрыПланирования.Вставить("УменьшатьВремяОжидания"                                  , Истина);
	ПараметрыПланирования.Вставить("ВыделятьКрупныеГрузы"                                    , Ложь);
	ПараметрыПланирования.Вставить("ПоказательКрупногоГруза"                                 , 0);
	ПараметрыПланирования.Вставить("РазмерКрупногоГруза"                                     , 1000);
	ПараметрыПланирования.Вставить("ВыделятьСрочныеГрузы"                                    , Ложь);
	ПараметрыПланирования.Вставить("КонтролироватьПревышениеЗагрузки"                        , Истина);
	ПараметрыПланирования.Вставить("ОграничиватьСписокЗон"                                   , Ложь);
	ПараметрыПланирования.Вставить("ДоступныеЗоны"                                           , Новый Соответствие);
	ПараметрыПланирования.Вставить("МестаИнтереса"                                           , Новый Массив);
	ПараметрыПланирования.Вставить("КоличествоВидимыхРейсов"                                 , 0);
	ПараметрыПланирования.Вставить("УчитыватьГрафикиРаботыОсновныхВодителей"                 , Ложь);
	ПараметрыПланирования.Вставить("УчитыватьРасписаниеРаботыТС"                             , Ложь);
	ПараметрыПланирования.Вставить("УчитыватьМестоположенияТС"                               , Ложь);
	ПараметрыПланирования.Вставить("УчитыватьДоступностьГеозонДляТранспорта"                 , Ложь);
	ПараметрыПланирования.Вставить("ЗональныйКоэффициент"                                    , 1);
	ПараметрыПланирования.Вставить("УчитыватьПропускиНаВъездВМосквуДляГрузовогоТранспорта"   , Ложь);
	ПараметрыПланирования.Вставить("УчитыватьДоступностьРесурсовПартнеров"                   , Ложь);
	ПараметрыПланирования.Вставить("УчитыватьВременныеОкнаПриРекомендацииРейсов"             , Истина);
	ПараметрыПланирования.Вставить("РассчитыватьРасстоянияПриОпределенииРекоммендуемыхРейсов", Ложь);
	ПараметрыПланирования.Вставить("ПериодАктуальностиСпутниковыхДанных"                     , 0.25);
	ПараметрыПланирования.Вставить("МаксимальноеКоличествоРекоммендаций"                     , 5);
	ПараметрыПланирования.Вставить("УчитыватьГабаритыГрузовыхМест"                           , Ложь);
	ПараметрыПланирования.Вставить("УчитыватьСовместимостьТовара"                            , Ложь);
	ПараметрыПланирования.Вставить("ЗапретитьМногократныйОбходТаблицыСбережений"             , Ложь);
	ПараметрыПланирования.Вставить("ИзменятьНачалоРейсаСУчетомДоступностиСкладскихВорот"     , Ложь);
	ПараметрыПланирования.Вставить("РазрешенаПогрузкаСНесколькихСкладов"                     , Ложь);
	ПараметрыПланирования.Вставить("ОграничитьКоличествоСкладовВРейсе"                       , Ложь);
	ПараметрыПланирования.Вставить("КоличествоСкладовВРейсе"                                 , 2);
	ПараметрыПланирования.Вставить("НачинатьРейсВДепоСОсновнымВидомТочкиОтправления"         , Ложь);
	ПараметрыПланирования.Вставить("ВключатьГрузыПоЗаявкеСЕдинымАдресомПолученияВЕдиныйРейс" , Ложь);
	ПараметрыПланирования.Вставить("КонтролироватьКоличествоПосадочныхМест"                  , Ложь);
	ПараметрыПланирования.Вставить("УчитыватьПриоритетностьЗаданийНаПеревозку"               , Ложь);
	ПараметрыПланирования.Вставить("РазрешеноЦиклическоеПланирование"                        , Ложь);
	ПараметрыПланирования.Вставить("ВсегдаВключатьОбъединениеПоПромежуточнымТочкам"          , Ложь);
	ПараметрыПланирования.Вставить("ВключатьГрузыСЕдинымАдресомПолученияВЕдиныйРейс"         , Ложь);
	ПараметрыПланирования.Вставить("УчитыватьМинимальноеКоличествоГрузовПриДеленииЗаданий"   , Ложь);
	ПараметрыПланирования.Вставить("МинимальноеКоличествоГрузовПриДеленииЗаданий"            , 1);

	Возврат ПараметрыПланирования;

КонецФункции

// Возвращает структуру значений параметров спутникового мониторинга по умолчанию.
//
// Возвращаемое значение:
//   Структура - Параметры по умолчанию.
//
Функция ПараметрыСпутниковогоМониторингаПоУмолчанию() Экспорт 
	
	ПараметрыМониторинга = Новый Структура;
	ПараметрыМониторинга.Вставить("СписокЗон", Новый Массив);
	ПараметрыМониторинга.Вставить("МестаИнтереса", Новый Массив);
	ПараметрыМониторинга.Вставить("ДопустимыйОбъемДанныхТрекера", 0);
	Возврат ПараметрыМониторинга;

КонецФункции // ПараметрыСпутниковогоМониторингаПоУмолчанию()

// Возвращает структуру значений параметров спутникового мониторинга по умолчанию.
//
// Возвращаемое значение:
//   Структура - Параметры по умолчанию.
//
Функция ПараметрыСпутниковогоМониторингаРежимРейсыПоУмолчанию() Экспорт 
	
	ПараметрыРежимаПоУмолчанию = Новый Структура;
	ПараметрыРежимаПоУмолчанию.Вставить("РежимИстории"                                        , Ложь);
	ПараметрыРежимаПоУмолчанию.Вставить("НачалоПериода"                                       , Неопределено);
	ПараметрыРежимаПоУмолчанию.Вставить("КонецПериода"                                        , Неопределено);
	ПараметрыРежимаПоУмолчанию.Вставить("ОтображатьПоследниеДанныеТрекера"                    , Истина);
	ПараметрыРежимаПоУмолчанию.Вставить("ОтображатьПоследниеДанныеДатчиков"                   , Истина); 
	ПараметрыРежимаПоУмолчанию.Вставить("ОтображатьТрекиДвиженияПоРейсам"                     , Истина);
	ПараметрыРежимаПоУмолчанию.Вставить("ОтображатьСобытияМониторингаНаКарте"                 , Истина);
	ПараметрыРежимаПоУмолчанию.Вставить("ПериодОтображенияСобытийМониторинга"                 , 5);
	ПараметрыРежимаПоУмолчанию.Вставить("ВремяОтображениеТрекаМинут"                          , 0);
	ПараметрыРежимаПоУмолчанию.Вставить("ВремяОтображениеТрекаЧасов"                          , 2);
	ПараметрыРежимаПоУмолчанию.Вставить("ИспользоватьАвтообновлениеДанных"                    , Истина);
	ПараметрыРежимаПоУмолчанию.Вставить("ПериодАвтообновления"                                , 120); // в секундах
	ПараметрыРежимаПоУмолчанию.Вставить("ДопустимыйПериодОтсутствияСвязиСТрекером"            , 10); // в минутах
	ПараметрыРежимаПоУмолчанию.Вставить("ОтображатьПериодыОтсутствияСвязи"                    , Истина);
	ПараметрыРежимаПоУмолчанию.Вставить("ОтображатьТрекЦветомПоСкоростиДвиженияРейсы"         , Ложь);
	ПараметрыРежимаПоУмолчанию.Вставить("ЦветоваяШкалаРейсы"                                  , Справочники.упЦветовыеШкалы.ПустаяСсылка());
	Возврат ПараметрыРежимаПоУмолчанию;
	
КонецФункции // ПараметрыСпутниковогоМониторингаРежимРейсыПоУмолчанию()

// Возвращает структуру значений параметров спутникового мониторинга по умолчанию.
//
// Возвращаемое значение:
//   Структура - Параметры по умолчанию.
//
Функция ПараметрыСпутниковогоМониторингаРежимТранспортПоУмолчанию() Экспорт 
	
	ПараметрыРежимаПоУмолчанию = Новый Структура;
	ПараметрыРежимаПоУмолчанию.Вставить("РежимИстории"                                        , Ложь);
	ПараметрыРежимаПоУмолчанию.Вставить("ПериодОтображенияТрека"                              , 2);
	ПараметрыРежимаПоУмолчанию.Вставить("ОтображатьПоследниеДанныеТрекера"                    , Истина);
	ПараметрыРежимаПоУмолчанию.Вставить("ОтображатьПоследниеДанныеДатчиков"                   , Истина); 
	ПараметрыРежимаПоУмолчанию.Вставить("ОтображатьТекущиеСостоянияТранспортныхСредствНаКарте", Истина);
	ПараметрыРежимаПоУмолчанию.Вставить("ОтображатьСобытияМониторингаНаКарте"                 , Истина);
	ПараметрыРежимаПоУмолчанию.Вставить("ПериодОтображенияСобытийМониторинга"                 , 5);
	ПараметрыРежимаПоУмолчанию.Вставить("ОтображатьТрекиДвиженияТранспорта"                   , Истина);
	ПараметрыРежимаПоУмолчанию.Вставить("ВремяОтображениеТрекаМинут"                          , 0);
	ПараметрыРежимаПоУмолчанию.Вставить("ВремяОтображениеТрекаЧасов"                          , 2);
	ПараметрыРежимаПоУмолчанию.Вставить("ИспользоватьАвтообновлениеДанных"                    , Истина);
	ПараметрыРежимаПоУмолчанию.Вставить("ПериодАвтообновления"                                , 120);
	ПараметрыРежимаПоУмолчанию.Вставить("ДопустимыйПериодОтсутствияСвязиСТрекером"            , 10);
	ПараметрыРежимаПоУмолчанию.Вставить("ОтображатьПериодыОтсутствияСвязи"                    , Истина);
	ПараметрыРежимаПоУмолчанию.Вставить("ОтображатьТрекЦветомПоСкоростиДвиженияТС"            , Ложь);
	ПараметрыРежимаПоУмолчанию.Вставить("ЦветоваяШкалаТС"                                     , Справочники.упЦветовыеШкалы.ПустаяСсылка());
	Возврат ПараметрыРежимаПоУмолчанию;
	
КонецФункции // ПараметрыСпутниковогоМониторингаРежимРейсыПоУмолчанию()

// Возвращает структуру значений параметров управления ремонтами по умолчанию.
//
// Возвращаемое значение:
//   Структура - Параметры по умолчанию.
//
Функция ПараметрыУправленияРемонтамиПоУмолчанию() Экспорт 
	
	ПараметрыУправленияРемонтами = Новый Структура;
	ПараметрыУправленияРемонтами.Вставить("СрокОтсчетаСреднесуточногоПробега", Перечисления.упСрокиОтсчета.ЗаПоследнююНеделю);
	ПараметрыУправленияРемонтами.Вставить("СрокПредупрежденияОТОДней"        , 20);
	ПараметрыУправленияРемонтами.Вставить("СрокПредупрежденияОТОПробег"      , 2000);
	ПараметрыУправленияРемонтами.Вставить("СрокПредупрежденияОТОМоточасы"    , 200);
	ПараметрыУправленияРемонтами.Вставить("СпособПланированияРемонтныхРабот" , Перечисления.упСпособыПланированияРемонтныхРабот.ПоВыбору);
	
	Возврат ПараметрыУправленияРемонтами;

КонецФункции // ПараметрыУправленияРемонтамиПоУмолчанию()

// Возвращает структуру значений параметров Планирования ремонтами по умолчанию.
//
// Возвращаемое значение:
//   Структура - Параметры по умолчанию.
//
Функция ПараметрыПланированиеРемонтовПоУмолчанию() Экспорт 
	
	ПараметрыУправленияРемонтами = Новый Структура;
	ПараметрыУправленияРемонтами.Вставить("СпособПланированияРемонтныхРабот", Перечисления.упСпособыПланированияРемонтныхРабот.ПоВыбору);
	
	Возврат ПараметрыУправленияРемонтами;

КонецФункции // ПараметрыПланированиеРемонтовПоУмолчанию()

// Возвращает структуру значений параметров формы редактирования этапов перевозки.
//
// Возвращаемое значение:
//   Структура - Параметры по умолчанию.
//
Функция ПараметрыНастроекФормыРедактированияЭтаповПеревозкиПоУмолчанию() Экспорт 
	
	ПараметрыНастроекФормы = Новый Структура;
	ПараметрыНастроекФормы.Вставить("ВключатьВЗаголовокВершиныНаГрафеНаименованиеАдреса", Ложь);
	ПараметрыНастроекФормы.Вставить("ВыводитьИнформациюОПараметрахГрузовНаРебрахГрафа"  , Ложь);
	ПараметрыНастроекФормы.Вставить("ПоказыватьОтмененныеЭтапыПеревозкиНаГрафе"         , Истина);
	ПараметрыНастроекФормы.Вставить("ИспользоватьИерархическоеПредставлениеГрафа"       , Истина);
	ПараметрыНастроекФормы.Вставить("ФигураВершиныГрафа"                                , 1);  // 1 - эллипс, 2 - круг, 3 - прямоугольник, 4 - картинка (из вида адреса), 5 - картинка в круге (из вида адреса)  
	ПараметрыНастроекФормы.Вставить("АвтоматическиОпределятьГрузовойСоставНовогоЭтапа"  , Истина);
	
	Возврат ПараметрыНастроекФормы;

КонецФункции // ПараметрыНастроекФормыРедактированияЭтаповПеревозкиПоУмолчанию()

#КонецОбласти
